import PhonologicalOpacity.Attenuation.Productive.Baseline.ProductiveGua
namespace ProductiveGua
open Retained
def uG34a : Input := ⟨["a","h","ɛ","t","e","ɔ","k","p","ʊ","k","ɔ"],[0,0,0,1,1,2,2,2,2,2,2],[2,4,5],[0,0,0]⟩
def rowsG34a : List (List String) := [["∅","a","ɜ","ɛ","e","ɪ","i","ɔ","o","ʊ","u","j","w"],["h"],["∅","a","ɜ","ɛ","e","ɪ","i","ɔ","o","ʊ","u","j","w"],["t"],["∅","a","ɜ","ɛ","e","ɪ","i","ɔ","o","ʊ","u","j","w"],["∅","a","ɜ","ɛ","e","ɪ","i","ɔ","o","ʊ","u","j","w"],["k"],["p"],["∅","a","ɜ","ɛ","e","ɪ","i","ɔ","o","ʊ","u","j","w"],["k"],["∅","a","ɜ","ɛ","e","ɪ","i","ɔ","o","ʊ","u","j","w"]]
def goalG34a : List String := ["a","h","e","t","ɔ","ɔ","k","p","ʊ","k","ɔ"]
def outG34a : String := "ahetɔɔkpʊkɔ"
def uG34b : Input := ⟨["a","f","ɪ","s","ɛ","o","h","i","l","i"],[0,0,0,1,1,2,2,2,2,2],[2,4,5],[0,0,0]⟩
def rowsG34b : List (List String) := [["∅","a","ɜ","ɛ","e","ɪ","i","ɔ","o","ʊ","u","j","w"],["f"],["∅","a","ɜ","ɛ","e","ɪ","i","ɔ","o","ʊ","u","j","w"],["s"],["∅","a","ɜ","ɛ","e","ɪ","i","ɔ","o","ʊ","u","j","w"],["∅","a","ɜ","ɛ","e","ɪ","i","ɔ","o","ʊ","u","j","w"],["h"],["∅","a","ɜ","ɛ","e","ɪ","i","ɔ","o","ʊ","u","j","w"],["l"],["∅","a","ɜ","ɛ","e","ɪ","i","ɔ","o","ʊ","u","j","w"]]
def goalG34b : List String := ["a","f","ɪ","s","o","o","h","i","l","i"]
def outG34b : String := "afɪsoohili"
def uN7 : Input := ⟨["a","tʃ","ɪ","j","e","l","i"],[0,0,0,1,1,1,1],[2,4],[0,0]⟩
def rowsN7 : List (List String) := [["∅","a","ɜ","ɛ","e","ɪ","i","ɔ","o","ʊ","u","j","w"],["tʃ"],["∅","a","ɜ","ɛ","e","ɪ","i","ɔ","o","ʊ","u","j","w"],["∅","a","ɜ","ɛ","e","ɪ","i","ɔ","o","ʊ","u","j","w"],["∅","a","ɜ","ɛ","e","ɪ","i","ɔ","o","ʊ","u","j","w"],["l"],["∅","a","ɜ","ɛ","e","ɪ","i","ɔ","o","ʊ","u","j","w"]]
def goalN7 : List String := ["a","tʃ","i","j","e","l","i"]
def outN7 : String := "atʃijeli"
def uG37c : Input := ⟨["ɔ","tʃ","ʊ","s","ɛ","i","b","i","e"],[0,0,0,1,1,2,2,2,2],[2,4,5],[0,0,0]⟩
def rowsG37c : List (List String) := [["∅","a","ɜ","ɛ","e","ɪ","i","ɔ","o","ʊ","u","j","w"],["tʃ"],["∅","a","ɜ","ɛ","e","ɪ","i","ɔ","o","ʊ","u","j","w"],["s"],["∅","a","ɜ","ɛ","e","ɪ","i","ɔ","o","ʊ","u","j","w"],["∅","a","ɜ","ɛ","e","ɪ","i","ɔ","o","ʊ","u","j","w"],["b"],["∅","a","ɜ","ɛ","e","ɪ","i","ɔ","o","ʊ","u","j","w"],["∅","a","ɜ","ɛ","e","ɪ","i","ɔ","o","ʊ","u","j","w"]]
def goalG37c : List String := ["ɔ","tʃ","ʊ","s","e","j","b","i","e"]
def outG37c : String := "ɔtʃʊsejbie"
def uC24ei : Input := ⟨["k","p","e","i","s","i"],[0,0,0,1,1,1],[2,3],[0,0]⟩
def rowsC24ei : List (List String) := [["k"],["p"],["∅","a","ɜ","ɛ","e","ɪ","i","ɔ","o","ʊ","u","j","w"],["∅","a","ɜ","ɛ","e","ɪ","i","ɔ","o","ʊ","u","j","w"],["s"],["∅","a","ɜ","ɛ","e","ɪ","i","ɔ","o","ʊ","u","j","w"]]
def goalC24ei : List String := ["k","p","e","j","s","i"]
def outC24ei : String := "kpejsi"
def uOR38 : Input := ⟨["a","tʃ","ɔ","s","ɪ","i","k","u"],[0,0,0,1,1,2,2,2],[2,4,5],[0,0,0]⟩
def rowsOR38 : List (List String) := [["∅","a","ɜ","ɛ","e","ɪ","i","ɔ","o","ʊ","u","j","w"],["tʃ"],["∅","a","ɜ","ɛ","e","ɪ","i","ɔ","o","ʊ","u","j","w"],["s"],["∅","a","ɜ","ɛ","e","ɪ","i","ɔ","o","ʊ","u","j","w"],["∅","a","ɜ","ɛ","e","ɪ","i","ɔ","o","ʊ","u","j","w"],["k"],["∅","a","ɜ","ɛ","e","ɪ","i","ɔ","o","ʊ","u","j","w"]]
def goalOR38 : List String := ["a","tʃ","ɔ","s","i","∅","k","u"]
def outOR38 : String := "atʃɔsiku"
def uC21b : Input := ⟨["w","ʊ","s","ʊ","ɪ","s","ɛ"],[0,0,0,0,1,1,1],[3,4],[0,0]⟩
def rowsC21b : List (List String) := [["∅","a","ɜ","ɛ","e","ɪ","i","ɔ","o","ʊ","u","j","w"],["∅","a","ɜ","ɛ","e","ɪ","i","ɔ","o","ʊ","u","j","w"],["s"],["∅","a","ɜ","ɛ","e","ɪ","i","ɔ","o","ʊ","u","j","w"],["∅","a","ɜ","ɛ","e","ɪ","i","ɔ","o","ʊ","u","j","w"],["s"],["∅","a","ɜ","ɛ","e","ɪ","i","ɔ","o","ʊ","u","j","w"]]
def goalC21b : List String := ["w","ʊ","s","ʊ","∅","s","ɛ"]
def outC21b : String := "wʊsʊsɛ"
def uC23UE : Input := ⟨["w","ʊ","s","ʊ","ɛ","b","ɪ"],[0,0,0,0,1,1,1],[3,4],[0,0]⟩
def rowsC23UE : List (List String) := [["∅","a","ɜ","ɛ","e","ɪ","i","ɔ","o","ʊ","u","j","w"],["∅","a","ɜ","ɛ","e","ɪ","i","ɔ","o","ʊ","u","j","w"],["s"],["∅","a","ɜ","ɛ","e","ɪ","i","ɔ","o","ʊ","u","j","w"],["∅","a","ɜ","ɛ","e","ɪ","i","ɔ","o","ʊ","u","j","w"],["b"],["∅","a","ɜ","ɛ","e","ɪ","i","ɔ","o","ʊ","u","j","w"]]
def goalC23UE : List String := ["w","ʊ","s","w","ɛ","b","ɪ"]
def outC23UE : String := "wʊswɛbɪ"
end ProductiveGua
